import React from 'react'
import {Accordion} from 'react-bootstrap'
const PunkBase = () => {
  return (
    <div><Accordion accordion-flush>
    <Accordion.Item eventKey="0">
      <Accordion.Header>Точка и точка с запятой</Accordion.Header>
      <Accordion.Body>
      <strong>Точка</strong> 
      <p>Tочка ставится в конце законченного повествовательного предложения, как полного, так и неполного.</p>
      <p>Точка ставится для придания изложению большей выразительности после коротких предложений, рисующих какую-нибудь единую картину или быструю смену событий.</p>
      <p>Точка ставится перед союзами и, а, но, однако и т. п., если они не связывают в одно целое предложения, а начинают собой самостоятельное предложение.</p>
      <p>Точка ставится в конце рубрик перечисления (и в том случае, когда оно следует за двоеточием), если рубрики эти являются достаточно развитыми и особенно если они представляют собой самостоятельные предложения и если внутри их уже есть какие-либо знаки препинания.</p>
      <p>Точка ставится после предложения, вводящего в дальнейшее изложение, если последнее представляет собой развернутое повествование, описание или рассуждение.</p>
      <strong>Точка с запятой</strong>
      <p>Точка с запятой ставится между независимыми предложениями, объединяемыми в одно сложное предложение без помощи союзов, особенно если такие предложения значительно распространены и имеют внутри себя запятые.</p>
      <p>Точка с запятой ставится между независимыми предложениями, объединяемыми в одно сложное предложение и связанными между собой:<ol>
       <li>Союзами но, однако, всё же, тем не менее и т. п., особенно если эти предложения значительно распространены или имеют внутри себя запятые.</li>
       <li>Союзами и и да (в значении «и») лишь в том случае, когда они соединяют два предложения, которые без них были бы разделены точкой.</li> </ol></p>
      <p>Точка с запятой ставится между распространёнными однородными членами предложения, особенно если внутри хотя бы одного из них есть запятые.</p>
      <p>Точка с запятой ставится между значительно распространёнными придаточными предложениями, подчинёнными одному и тому же главному, если между придаточными нет сочинительного союза, особенно когда внутри таких придаточных имеются в свою очередь придаточные предложения.</p>
      <p>Точка с запятой ставится между группами независимых предложений, а также между группами придаточных предложений, относящихся к одному главному, если необходимо указать границы между группами предложений в отличие от границ между отдельными предложениями.</p>
      <p>Точка с запятой ставится в конце рубрик перечисления, если рубрики эти не являются самостоятельными предложениями, но достаточно распространены, и особенно если внутри их уже есть какие-либо знаки препинания.</p>
      </Accordion.Body>
    </Accordion.Item>
    <Accordion.Item eventKey="1">
      <Accordion.Header>Запятая</Accordion.Header>
      <Accordion.Body>
      <strong>Перед союзами</strong>
      <p>Если в предложении встречаются союзы А, НО, ЗАТО и ДА (в значении НО), перед ними всегда ставим запятую.</p>
      <strong>Между однородными членами предложения</strong>
      <p>Запятые всегда ставятся между однородными членами предложения. Однородные члены предложения отвечают на один и тот же вопрос и несут одинаковую синтаксическую функцию. Они могут соединяться союзами или обходиться без них. По правилам пунктуации если однородные члены предложения объединены союзом, то перед первым однородным членом запятая не нужна.</p>
      <strong>Деепричастные и причастные обороты</strong>
      <p>По правилам расстановки запятых, ими выделяются причастные обороты, стоящие после определяемого слова. Деепричастия и деепричастные обороты выделяются всегда.</p>
      <strong>Сложные предложения</strong>
      <p>В русском языке существуют простые и сложные предложения. Сложные состоят из нескольких простых, называемых также грамматическими основами. Между частями сложного предложения ставится запятая.</p>
      <strong>Обращения</strong>
      <p>Запятыми выделяется любое обращение.</p>
      <strong>Запятыми выделяется любое обращение.</strong>
      <p>Вводные слова не вступают в синтаксическую связь с другими членами предложения и, как правило, выражают отношение говорящего к предмету разговора, его оценку или сообщают о связи с контекстом. Кстати, словосочетание «как правило» в предыдущем предложении выполняет роль вводного. Вводные слова и словосочетания всегда выделяются запятыми.</p>
      <strong>Уточняющие слова и сравнительные обороты</strong>
      <p>Запятые в предложениях отделяют уточняющие слова, уточняющие или поясняющие предыдущие члены предложения.Запятые ставятся перед сравнительными оборотами — словами или выражениями, обозначающими сравнение и начинающимися с союзов КАК, СЛОВНО, ТОЧНО, БУДТО и КАК БУДТО.</p>
      <strong>Запятые не ставятся:</strong>
      <ul>
      <il>Перед неоднородными членами предложения, описывающими разные свойства предмета.</il> 
      <il>В сложносочиненном предложении, если у грамматических основ есть общее придаточное предложение.</il>
      <il>Если причастный оборот стоит перед определяемым словом.</il>
      <il>Если деепричастный оборот стал устойчивым выражением.</il>
      <il>Если деепричастие превратилось в наречие.</il>
      <il>Если сравнительные обороты превратились в устойчивые сочетания.</il>
      <il>После слова ОДНАКО в значении, НО</il>
      <il>В устойчивых сочетаниях: сделать как должно, хватать что подвернётся, явиться как ни в чем не бывало, как бы то ни было и во что бы то ни стало.</il>
      <il>Если в сложноподчинённом предложении придаточное состоит из одного слова.</il>
      </ul>
      </Accordion.Body>
    </Accordion.Item>
    <Accordion.Item eventKey="2">
      <Accordion.Header>Другие знаки препинания</Accordion.Header>
      <Accordion.Body>
      <strong>Двоеточие</strong>
      <p>Двоеточие ставится перед перечислением, которым заканчивается предложение:<ol>
        <il>Если перечислению предшествует обобщающее слово (а нередко, кроме того, ещё слова например, как-то, а именно).</il>
        <il>Если перед перечислением нет обобщающего слова, но необходимо предупредить читателя, что далее следует какой-либо перечень.</il></ol></p>
      <p>Двоеточие ставится перед перечислением, находящимся в середине предложения, если перечислению предшествует обобщающее слово или слова как-то, например, а именно.</p>
      <p>Двоеточие ставится после предложения, за которым следует одно или несколько предложений, не соединённых с первым посредством союзов и заключающих в себе:<ol>
        <il>разъяснение или раскрытие содержания того, о чём говорится в первом предложении.</il>
        <il>основание, причина того, о чём говорится в первом предложении.</il></ol></p>
      <p>Двоеточие ставится между двумя предложениями, не соединёнными посредством союзов, если в первом предложении такими глаголами, как видеть, смотреть, слышать, знать, чувствовать и т. п., делается предупреждение, что далее последует изложение какого-нибудь факта или какое-нибудь описание.</p>
      <p>Двоеточие ставится после предложения, вводящего прямую речь, в частности — прямой вопрос или восклицание.</p>
      <strong>Тире</strong><p>Тире ставится в предложениях с составным именным сказуемым, между подлежащими и сказуемым.</p>
      <p>Eсли в предложении подлежащее выражено именем существительным, а сказуемое неопределенной формой глагола (инфинитивом), или они оба выражены инфинитивом, тогда между ними ставится тире.</p>
      <p>Тире ставится перед словами «это», «значит», «это есть», «вот» и др. в предложениях, где сказуемое выражено именем существительным в именительном падеже или инфинитивом.</p>
      <p> Тире ставится в предложениях с перечислениями перед обобщающим словом.</p>
      <p>Тире ставится перед стоящим в конце предложения приложением в двух случаях:<ul>
        <li>Если перед приложением можно без искажения смысла предложения поставить конструкцию «а именно».</li>
        <li>Если при приложении используются пояснительные слова, и автору требуется дополнительно обозначить самостоятельность этой конструкции.</li></ul></p>
      <p>Тире ставится между двумя сказуемыми или между частями сложного предложения в том случае, если автору нужно неожиданно присоединить или резко противопоставить их по отношению друг к другу.</p>
      <p>Тире ставится между частями бессоюзного сложного предложения в том случае, если вторая часть содержит в себе результат или вывод из того, о чем говорилось в первой.</p>
      <p>Тире ставится между частями бессоюзного сложного предложения в том случае, если между ними существует вид связи «придаточная часть – главная часть».</p>
      <p>Тире ставится для того, чтобы указать границу распада простого предложения на две словесные группы.Делается это только в том случае, если иными средствами выделить этот распад не получается.</p>
      <p>Тире может использоваться как дополнительный знак препинания после запятой в предложениях, где есть два повторяющихся слова, причем нужно это повторение для того, чтобы связать одну часть этого предложения с другой.</p>
      <strong>Знак вопросительный</strong><p>Знак вопросительный ставится после прямого вопроса, в том числе и после следующих одно за другим неполных вопросительных предложений.</p>
      <strong>Знак восклицательный</strong><p>Знак восклицательный ставится в конце восклицательного предложения.</p>
      <p>Знак восклицательный ставится после обращений, стоящих в начале предложения, и междометий, стоящих как в начале, так и в середине предложения (второе встречается только в поэтической речи), если такие обращения и междометия являются восклицательными.</p>
      <strong>Многточие</strong><p>Многоточие ставится для обозначения незаконченности высказывания, причём знаки вопросительный и восклицательный, если они требуются характером предложения, сохраняются перед многоточием.</p>
      <strong>Скобки</strong><p>В скобки заключаются слова и предложения, вставляемые в предложение с целью пояснения или дополнения высказываемой мысли, а также для каких-либо добавочных замечаний. Вставленными в предложение могут быть:<ol>
        <li>Слова или предложения, синтаксически не связанные с данным предложением и приводимые для пояснения всей мысли в целом или её части.</li>
        <li>Слова и предложения, синтаксически не связанные с данным предложением и приводимые в качестве добавочного замечания, в том числе и выражающие вопросы или восклицание.</li>
        <li>.Слова и предложения, хотя и связанные синтаксически с данным предложением, но приводимые в качестве добавочного, второстепенного замечания.</li></ol></p>
      <strong>Кавычки</strong><p>Кавычками выделяются цитаты.</p>
      <p>Кавычками выделяются: слова, употребляемые не в своём обычном значении; слова, употребляемые иронически; слова, впервые предлагаемые или, наоборот, устарелые и необычные и т. п.</p> 
      </Accordion.Body>
    </Accordion.Item>
  </Accordion>
     
    </div>
  )
}

export default PunkBase